/* $Id: DMG.cpp $ */
/** @file
 * VBoxDMG - Interpreter for Apple Disk Images (DMG).
 */

 /*
  * Copyright (C) 2010-2023 Oracle and/or its affiliates.
  *
  * This file is part of VirtualBox base platform packages, as
  * available from https://www.virtualbox.org.
  *
  * This program is free software; you can redistribute it and/or
  * modify it under the terms of the GNU General Public License
  * as published by the Free Software Foundation, in version 3 of the
  * License.
  *
  * This program is distributed in the hope that it will be useful, but
  * WITHOUT ANY WARRANTY; without even the implied warranty of
  * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
  * General Public License for more details.
  *
  * You should have received a copy of the GNU General Public License
  * along with this program; if not, see <https://www.gnu.org/licenses>.
  *
  * SPDX-License-Identifier: GPL-3.0-only
  */


#include <grub/types.h>
#include <grub/misc.h>
#include <grub/file.h>
#include <grub/mm.h>
#include <grub/deflate.h>

#include "../lib/vbox/vbox.h"

GRUB_MOD_LICENSE("GPLv3+");

/*********************************************************************************************************************************
*   Structures and Typedefs                                                                                                      *
*********************************************************************************************************************************/

/** Sector size, multiply with all sector counts to get number of bytes. */
#define DMG_SECTOR_SIZE 512

/** Convert block number/size to byte offset/size. */
#define DMG_BLOCK2BYTE(u)          ((grub_uint64_t)(u) << 9)

/** Convert byte offset/size to block number/size. */
#define DMG_BYTE2BLOCK(u)          ((u) >> 9)

/**
 * UDIF checksum structure.
 */
typedef struct DMGUDIFCKSUM
{
	grub_uint32_t        u32Kind;                    /**< The kind of checksum.  */
	grub_uint32_t        cBits;                      /**< The size of the checksum. */
	union
	{
		grub_uint8_t     au8[128];                   /**< 8-bit view. */
		grub_uint32_t    au32[32];                   /**< 32-bit view. */
	}                    uSum;                       /**< The checksum. */
} DMGUDIFCKSUM;

typedef DMGUDIFCKSUM* PDMGUDIFCKSUM;
typedef const DMGUDIFCKSUM* PCDMGUDIFCKSUM;

/** @name Checksum Kind (DMGUDIFCKSUM::u32Kind)
 * @{ */
 /** No checksum. */
#define DMGUDIFCKSUM_NONE          0U
/** CRC-32. */
#define DMGUDIFCKSUM_CRC32         2U
/** @} */

/**
 * UDIF ID.
 * This is kind of like a UUID only it isn't, but we'll use the UUID
 * representation of it for simplicity.
 */
typedef RTUUID DMGUDIFID;

typedef DMGUDIFID* PDMGUDIFID;
typedef const DMGUDIFID* PCDMGUDIFID;

/**
 * UDIF footer used by Apple Disk Images (DMG).
 *
 * This is a footer placed 512 bytes from the end of the file. Typically a DMG
 * file starts with the data, which is followed by the block table and then ends
 * with this structure.
 *
 * All fields are stored in big endian format.
 */
#pragma pack(1)
typedef struct DMGUDIF
{
	grub_uint32_t            u32Magic;               /**< 0x000 - Magic, 'koly' (DMGUDIF_MAGIC).                       (fUDIFSignature) */
	grub_uint32_t            u32Version;             /**< 0x004 - The UDIF version (DMGUDIF_VER_CURRENT).              (fUDIFVersion) */
	grub_uint32_t            cbFooter;               /**< 0x008 - The size of the this structure (512).                 (fUDIFHeaderSize) */
	grub_uint32_t            fFlags;                 /**< 0x00c - Flags.                                                (fUDIFFlags) */
	grub_uint64_t            offRunData;             /**< 0x010 - Where the running data fork starts (usually 0).       (fUDIFRunningDataForkOffset) */
	grub_uint64_t            offData;                /**< 0x018 - Where the data fork starts (usually 0).               (fUDIFDataForkOffset) */
	grub_uint64_t            cbData;                 /**< 0x020 - Size of the data fork (in bytes).                     (fUDIFDataForkLength) */
	grub_uint64_t            offRsrc;                /**< 0x028 - Where the resource fork starts (usually cbData or 0). (fUDIFRsrcForkOffset) */
	grub_uint64_t            cbRsrc;                 /**< 0x030 - The size of the resource fork.                        (fUDIFRsrcForkLength)*/
	grub_uint32_t            iSegment;               /**< 0x038 - The segment number of this file.                      (fUDIFSegmentNumber) */
	grub_uint32_t            cSegments;              /**< 0x03c - The number of segments.                               (fUDIFSegmentCount) */
	DMGUDIFID                SegmentId;              /**< 0x040 - The segment ID.                                       (fUDIFSegmentID) */
	DMGUDIFCKSUM             DataCkSum;              /**< 0x050 - The data checksum.                                    (fUDIFDataForkChecksum) */
	grub_uint64_t            offXml;                 /**< 0x0d8 - The XML offset (.plist kind of data).                 (fUDIFXMLOffset) */
	grub_uint64_t            cbXml;                  /**< 0x0e0 - The size of the XML.                                  (fUDIFXMLSize) */
	grub_uint8_t             abUnknown[120];         /**< 0x0e8 - Unknown stuff, hdiutil doesn't dump it... */
	DMGUDIFCKSUM             MasterCkSum;            /**< 0x160 - The master checksum.                                  (fUDIFMasterChecksum) */
	grub_uint32_t            u32Type;                /**< 0x1e8 - The image type.                                       (fUDIFImageVariant) */
	grub_uint64_t            cSectors;               /**< 0x1ec - The sector count. Warning! Unaligned!                 (fUDISectorCount) */
	grub_uint32_t            au32Unknown[3];         /**< 0x1f4 - Unknown stuff, hdiutil doesn't dump it... */
} DMGUDIF;
#pragma pack()

typedef DMGUDIF* PDMGUDIF;
typedef const DMGUDIF* PCDMGUDIF;

/** The UDIF magic 'koly' (DMGUDIF::u32Magic). */
#define DMGUDIF_MAGIC              0x6b6f6c79U

/** The current UDIF version (DMGUDIF::u32Version).
 * This is currently the only we recognizes and will create. */
#define DMGUDIF_VER_CURRENT        4

 /** @name UDIF flags (DMGUDIF::fFlags).
  * @{ */
  /** Flatten image whatever that means.
   * (hdiutil -debug calls it kUDIFFlagsFlattened.) */
#define DMGUDIF_FLAGS_FLATTENED    RT_BIT_32(0)
   /** Internet enabled image.
	* (hdiutil -debug calls it kUDIFFlagsInternetEnabled) */
#define DMGUDIF_FLAGS_INET_ENABLED RT_BIT_32(2)
	/** Mask of known bits. */
#define DMGUDIF_FLAGS_KNOWN_MASK   (RT_BIT_32(0) | RT_BIT_32(2))
/** @} */

/** UDIF Image Types (DMGUDIF::u32Type). */
/** Device image type. (kUDIFDeviceImageType) */
#define DMGUDIF_TYPE_DEVICE        1
/** Device image type. (kUDIFPartitionImageType) */
#define DMGUDIF_TYPE_PARTITION     2

/**
 * BLKX data.
 *
 * This contains the start offset and size of raw data stored in the image.
 *
 * All fields are stored in big endian format.
 */
#pragma pack(1)
typedef struct DMGBLKX
{
	grub_uint32_t            u32Magic;               /**< 0x000 - Magic, 'mish' (DMGBLKX_MAGIC). */
	grub_uint32_t            u32Version;             /**< 0x004 - The BLKX version (DMGBLKX_VER_CURRENT). */
	grub_uint64_t            cSectornumberFirst;     /**< 0x008 - The first sector number the block represents in the virtual device. */
	grub_uint64_t            cSectors;               /**< 0x010 - Number of sectors this block represents. */
	grub_uint64_t            offDataStart;           /**< 0x018 - Start offset for raw data. */
	grub_uint32_t            cSectorsDecompress;     /**< 0x020 - Size of the buffer in sectors needed to decompress. */
	grub_uint32_t            u32BlocksDescriptor;    /**< 0x024 - Blocks descriptor. */
	grub_uint8_t             abReserved[24];
	DMGUDIFCKSUM             BlkxCkSum;              /**< 0x03c - Checksum for the BLKX table. */
	grub_uint32_t            cBlocksRunCount;        /**< 0x    - Number of entries in the blkx run table afterwards. */
} DMGBLKX;
#pragma pack()

typedef DMGBLKX* PDMGBLKX;
typedef const DMGBLKX* PCDMGBLKX;

/** The BLKX magic 'mish' (DMGBLKX::u32Magic). */
#define DMGBLKX_MAGIC              0x6d697368U
/** BLKX version (DMGBLKX::u32Version). */
#define DMGBLKX_VERSION            0x00000001U

/** Blocks descriptor type: entire device. */
#define DMGBLKX_DESC_ENTIRE_DEVICE 0xfffffffeU

/**
 * BLKX table descriptor.
 *
 * All fields are stored in big endian format.
 */
#pragma pack(1)
typedef struct DMGBLKXDESC
{
	grub_uint32_t            u32Type;                /**< 0x000 - Type of the descriptor. */
	grub_uint32_t            u32Reserved;            /**< 0x004 - Reserved, but contains +beg or +end in case thisi is a comment descriptor. */
	grub_uint64_t            u64SectorStart;         /**< 0x008 - First sector number in the block this entry describes. */
	grub_uint64_t            u64SectorCount;         /**< 0x010 - Number of sectors this entry describes. */
	grub_uint64_t            offData;                /**< 0x018 - Offset in the image where the data starts. */
	grub_uint64_t            cbData;                 /**< 0x020 - Number of bytes in the image. */
} DMGBLKXDESC;
#pragma pack()

typedef DMGBLKXDESC* PDMGBLKXDESC;
typedef const DMGBLKXDESC* PCDMGBLKXDESC;

/** Raw image data type. */
#define DMGBLKXDESC_TYPE_RAW        1
/** Ignore type. */
#define DMGBLKXDESC_TYPE_IGNORE     2
/** Compressed with adc type. */
#define DMGBLKXDESC_TYPE_ADC        0x80000004U
/** Compressed with zlib type. */
#define DMGBLKXDESC_TYPE_ZLIB       0x80000005U
/** Compressed with bzlib type. */
#define DMGBLKXDESC_TYPE_BZLIB      0x80000006U
/** Compressed with lzfse type. */
#define DMGBLKXDESC_TYPE_LZFSE      0x80000007U
/** Comment type. */
#define DMGBLKXDESC_TYPE_COMMENT    0x7ffffffeU
/** Terminator type. */
#define DMGBLKXDESC_TYPE_TERMINATOR 0xffffffffU

/**
 * UDIF Resource Entry.
 */
typedef struct DMGUDIFRSRCENTRY
{
	/** The ID. */
	grub_int32_t             iId;
	/** Attributes. */
	grub_uint32_t            fAttributes;
	/** The name. */
